src/Catalogs/УчетныеДанныеRDP/УчетныеДанныеRDP.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УчетныеДанныеRDP</name>
  <owners>Catalog.Пользователи</owners>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>CatalogRef.Кластеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ШифрПароля</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоменПользователя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/УчетныеДанныеRDP/ManagerModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДанныеПодключенияПоСерверу(Сервер) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УчетныеДанныеRDP.Наименование КАК Наименование,
		|	УчетныеДанныеRDP.Сервер.Наименование КАК Сервер,
		|	УчетныеДанныеRDP.ШифрПароля КАК ШифрПароля,
		|	УчетныеДанныеRDP.ДоменПользователя КАК ДоменПользователя
		|ИЗ
		|	Справочник.УчетныеДанныеRDP КАК УчетныеДанныеRDP
		|ГДЕ
		|	УчетныеДанныеRDP.Владелец = &Пользователь
		|	И УчетныеДанныеRDP.Сервер = &Сервер";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());
	Запрос.УстановитьПараметр("Сервер", Сервер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
КонецФункции


#КонецОбласти

#КонецЕсли
